import { readable } from "svelte/store";
interface IfInterface {
  key: string;
  value: string | ((branch_value: string) => boolean);
  next?: "and" | "or";
}
interface ScoreInterface {
  targetId: string;
  action: (branch: string, rawValue: string) => string;
}
interface DialogInterface {
  type?: string;
  id?: string;
  name?: string;
  avatar?: string;
  message?: string;
  choice?: Array<string>;
  score?: ScoreInterface;
  if?: Array<IfInterface>;
  next?: string;
  prev?: string;
}
function Normal(
  id: string = "",
  name: string,
  avatar: string,
  message: string,
  ifbranch: IfInterface[] | undefined = undefined,
): DialogInterface {
  return {
    id: id,
    name: name,
    avatar: avatar,
    message: message,
    if: ifbranch,
  };
}
function Aside(
  message: string,
  ifbranch: IfInterface[] | undefined = undefined,
  id: string = "",
) {
  return Normal(id, "", "", message, ifbranch);
}
function George(
  message: string,
  ifbranch: IfInterface[] | undefined = undefined,
  id: string = "",
) {
  return Normal(
    id,
    `<span style="color: skyblue;">%name</span>`,
    "",
    message,
    ifbranch,
  );
}
function Admin(
  message: string,
  ifbranch: IfInterface[] | undefined = undefined,
  id: string = "",
) {
  return Normal(
    id,
    `<span style="color: lightgreen;">管理员</span>`,
    "",
    message,
    ifbranch,
  );
}
function Qm(
  message: string,
  ifbranch: IfInterface[] | undefined = undefined,
  id: string = "",
) {
  return Normal(
    id,
    `<span style="color: darkgray">??</span>`,
    "",
    message,
    ifbranch,
  );
}
function Tony(
  message: string,
  ifbranch: IfInterface[] | undefined = undefined,
  id: string = "",
) {
  return Normal(
    id,
    `<span style="color: orange">托尼</span>`,
    "",
    message,
    ifbranch,
  );
}
function Wildebeest(
  message: string,
  ifbranch: IfInterface[] | undefined = undefined,
  id: string = "",
) {
  return Normal(
    id,
    `<span style="color: lightcoral">角马</span>`,
    "",
    message,
    ifbranch,
  );
}
function Choice(
  id: string,
  choice: string[],
  ifbranch: IfInterface[] | undefined = undefined,
): DialogInterface {
  return {
    type: "choice",
    id: id,
    choice: choice,
    if: ifbranch,
  };
}
const ifbranch3a4: IfInterface[] = [
  {
    key: "branch3",
    value: "可是，到地球我能做什么呢？我的工作怎么办？",
    next: "and",
  },
  {
    key: "branch4",
    value: "托尼，你去过下面卫星吗？",
  },
];
const ifbranch3a4a5: IfInterface[] = [
  {
    key: "branch3",
    value: "可是，到地球我能做什么呢？我的工作怎么办？",
    next: "and",
  },
  {
    key: "branch4",
    value: "托尼，你去过下面卫星吗？",
    next: "and",
  },
  {
    key: "branch5",
    value: "卖掉船票",
  },
];
const ifbranch3o4o5: IfInterface[] = [
  {
    key: "branch3",
    value: "你说的对，再也不会有这么好的机会了。下一趟飞船在什么时候？",
    next: "or",
  },
  {
    key: "branch4",
    value: "你说的对，在到达地球前不需要考虑这种事。下一趟飞船在什么时候？",
    next: "or",
  },
  {
    key: "branch5",
    value: "不卖船票",
  },
];
export const dialogInstance = readable<DialogInterface[]>([
  Aside(
    "一个方正的房间。狭小，几乎推开门就会撞到桌子。金属桌腿和地板是一体的，典型的空间站早期风格，“为了预防可能的撞击”。除此之外，房间里只有档案柜，管理员，档案柜。他们沉默着。",
  ),
  Aside(
    "冷色的日光灯照在管理员的鬃毛上，在桌面上投下了巨大的阴影。这会离开门已经过去了几秒，他停笔，抬头看了看，稍稍坐直，身下的折叠椅发出不堪重负的噪音。",
  ),
  Admin("姓名？", [], "start1"),
  Choice("branch1", ["直接告诉他", "或者你先告诉我，你的名字？"]),
  ...(() => {
    const ifbranch: IfInterface[] = [
      {
        key: "branch1",
        value: "或者你先告诉我，你的名字？",
      },
    ];
    return [
      Admin("什么？", ifbranch),
      Qm("告诉我，你的名字。", ifbranch),
      Admin("没有这个流程，你到底办不办这个手续？", ifbranch),
      Qm("办。我只是……突然想关心你？", ifbranch),
      Admin("关心我？", ifbranch),
      Aside("他皱着眉，好像你说了什么高深的难以理解的术语", ifbranch),
      Admin("我只需要你回答问题。", ifbranch),
      Qm("好的。", ifbranch),
      Admin("名字？", ifbranch),
    ];
  })(),
  George("%name。"),
  Admin("种族？"),
  George("食肉动物。"),
  Admin("年龄？"),
  George("22岁。"),
  Admin("性别？"),
  George("雄。"),
  Admin("和死者关系？"),
  George("他是我的叔叔，我是他侄子。"),
  Admin("工作？"),
  George("废品分类中心。"),
  Aside("管理员挑着眉毛抬起了头，上下打量了一番。"),
  Aside(
    "你很平静。看吧，从头到脚都可以在他眼前展示。在过去10年里，每个人听说你的工作后都会忍不住这样看。",
  ),
  Admin("你就是那个%name？"),
  Choice("branch2", [
    "如果是指在废品分类中心工作的话，那就是我。",
    "对，我就是那个%name，和其他%name不一样的%name。哪怕两个互不相干的人，只要说“那个%name”，他们两个也会一起默契地点头。",
  ]),
  Aside("他微不可察地点了点头。"),
  Admin("在这里签字。"),
  Aside("一张纸被递了过来，你潦草地签好了名字。"), // 播放 签字声，无需阻止线程。
  Admin("看镜头，看这里。"),
  Aside("他按动了某处开关，一个照相机从边缘升上来。"),
  George("还要拍照？"),
  // 闪光声，快门声
  Admin("别说话，重拍。"),
  // 闪光声，快门声
  Admin("好了。出门左拐走到头，看到两扇大门推开进去。"),
  // 切换场景：走廊
  Aside("走廊像一条苍白的喉咙。"),
  // 托尼走上来
  Tony("%name，你还好吧？"),
  Choice("branch2", [
    "还好，只是没想到还要照相。",
    "不太好。我感觉自己要被闪光灯谋杀了。",
  ]),
  Tony(
    "流程罢了，手续顺利？我特意和同事打了招呼，他处理得快极了。我可见过这种事上拖拖拉拉能有多糟心。",
  ),
  Aside("你忍不住地去舔自己的鼻子。"),
  Tony(
    "我是说，节哀。我知道这很难接受，但查理叔叔走的很安详，他最后在垃圾传送带上拽下了一个蛋，几乎完好。天知道现在的人在想什么，这种东西都能出现在回收站，简直是道德败坏……",
  ),
  George("托尼，开始流程吧。我……我不想听那个。"),
  Tony("好的，好的，我明白。"),
  Aside(
    "托尼走到告别厅的大门前，你和他从小一起长大，也一直知道他在这里工作，但今天还是第一次看到他这幅打扮。",
  ),
  Aside("大门被拉开，门轴发出摩擦的声音。"),
  // 切换场景：告别厅
  Tony("那么，你和逝者的关系？"),
  Choice("branch2", [
    "又来？就非要做这种事吗？",
    "刚刚在那个办公室已经问过我一遍了。",
  ]),
  Aside("他耸了耸肩膀，给了我一个无奈的表情，“一种流程”。"),
  Tony("那么，你和逝者的关系？"),
  George("叔侄。"),
  Tony("在场诸位有异议吗？"),
  Aside(
    "整个告别厅里只有我和托尼。我不知道为什么会有这样的流程，也不想知道。我盯着虚空中的某一处，鼻子却实时提醒着我，这里是弥漫着消毒水味的告别厅。",
  ),
  Tony(
    "今天我们为一位逝者哀悼，为一位Am-ω-7太空港的驻守者哀悼，他完成了他的工作，还清了全部的债务，他是一名标准的、合格的……",
  ),
  Tony("%name？%name？"),
  Aside(
    "我听到有人在叫我的名字，回过神，托尼目光关切地看着我。我想，如果不是流程，他大概会下来给我一个拥抱。",
  ),
  George("抱歉……"),
  Tony("没事，该下一个环节了。"),
  Tony(
    "确认一下查理的遗产。他的遗产不多，一个还剩15年许可的储物柜兼1.74m可折叠式休息区，一点信用点存款，还有一个……蛋？那种情况下都能把它拽下来，唔，我都不知道该怎么说了。总之先签字吧。",
  ),
  // 签字声
  Tony("最后一个流程，啧。"),
  George("怎么了？"),
  Tony("我们可能有一点小麻烦，但相信我，会过去的，很简单。"),
  Aside("托尼看着我的眼睛，轻轻地推着我的手臂，让我在座位上坐好。"),
  Tony("请死者家属致辞。"),
  Aside("我站起身，准备走到讲台上。"),
  Tony("不，%name，你先在那边等一等。这个环节需要父母、妻子或者儿女。"),
  George("托尼？你在搞什么？"),
  Tony("流程。该死的流程就是这样的。请逝者家属致辞。请死者家属致辞。"),
  George(
    "这里唯一的家属就是我！而我要看你对着空屋子喊“请家属致辞”？这太荒唐了，荒唐！",
  ),
  Tony(
    "我……我真的没有办法，这就是流程。我可以站在这里和你解释，从现在解释到明天都可以。但是我不能不说那句话，也不能让你上台，我的工作就是这是这样。",
  ),
  George(
    "查理叔叔根本就没结过婚，他的父母早不在了，我就是他唯一的亲人，他也是我唯一的亲人！怎么才能取消这该死的流程？！",
  ),
  Aside("“唉。”托尼长长地叹了一口气，用那种熟悉的“我就知道”的眼神看着我。"),
  Tony("证明查理没有父母、妻子或子女。"),
  George("需要什么证明？"),
  Tony("没法证明。"),
  George("为什么？"),
  Tony("证明查理没有父母、妻子或子女。"),
  Tony(
    "因为大家都……你明白吗？有出生证明、结婚证明、离婚证明、工作场所出入证明，但不会专门有一份证明去证明你什么关系都没有。总之，等我喊三遍，确认他们未到场之后，你就可以签字走人了。前面的手续都非常顺利，这是最后一步。",
  ),
  George(
    "你是说，按流程，宁可喊三遍根本不存在的人，我也没法在我叔叔的葬礼上说什么？",
  ),
  Tony("是的。"),
  Aside(
    "熟悉的眼神。托尼看着我，我想我这样的表情他已经看过了很多很多次，以至于我们都相互了解对方会干些什么。",
  ),
  Tony("别做傻事。"),
  George("我什么都不做，那才是傻事。"),
  Tony("等等。等一等。只要你愿意等一小段时间，那就……"),
  George("我愿意。"),
  Tony(
    "那就等365天+178天+285天+974天后，只要没人来认领其他亲属的身份，你就可以凭遗产接受人的身份开始葬礼悼词了。",
  ),
  George("如果有人来怎么办？"),
  Tony(
    "骗子吗？他们不会来的，想要确认身份至少得开5到15份证明，等开完，你早已经签完字了。而且他们来干嘛？骗一个在葬礼上致辞的机会？除了你没人那么干。",
  ),
  Choice("branch2", [
    "谢谢，我真的非常感谢你……",
    "伙计，我以后会给你换一个闪闪发亮的无缝一体式头套，我说真的，无论多少钱我都要买给你。",
  ]),
  Aside(
    "我可能要哭了，鼻子在发酸，我想我刚刚的样子可能像是在胡闹，我也不知道为什么突然难以忍受，明明这一切马上就要过去……",
  ),
  Tony(
    "别来这套，这是我应该做的。我没什么可劝你的，这种事不是说几句话就能过去的，不管如何，你得保持健康。",
  ),
  Tony("%name？你在听吗？"),
  // 切换场景：走廊
  Aside(
    "我几乎想不起来我是怎么走出门的。难怪托尼从来不提他的工作，如果他每天面对的都是这种事，那么我也会什么都不说，一到公共休息区就来三管无酒精麻醉剂。",
  ),
  Tony("等等，%name！"),
  Aside("大门被推开，发出咔吱咔吱的响声。"),
  Aside(
    "托尼在身后喊我，我回头看去。他怀里抱着一条巨大的乳白色的蛋，蛋壳上闪着牙齿一样的光泽。托尼甚至没法一只手托住它。他双手抱着蛋，艰难地用肩膀顶开大门。",
  ),
  Tony(
    "这个算是HB-c1，特殊活体宠物，按照规定……别管那些了，总之你可以先把这个带走。其他什么也别放在心上，就算不走完流程你也可以继续在查理的位置睡，根本没人管这种事。",
  ),
  Choice("branch2", ["谢谢你，托尼", "亲吻托尼"]),
  Aside("我抱住了他，那枚蛋隔在我俩中间，撞在托尼坚硬的身体上发出一声脆响。"),
  // 切换场景：宿舍床铺
  Aside(
    "最终，你回到休息区，带着饥饿、疲惫还有些陌生的情绪，你并不愿意去确认那到底是什么。",
  ),
  Aside("蛋也没事，它完整地被你带回来了。"),
  Aside(
    "休息区仍是你熟悉的样子，紧贴墙壁的垂直货架，上面摆了许多稀奇的小玩意——都是从垃圾传送带上捡回来的。",
  ),
  Aside("把货架沿着滑轨抬上去，剩下的空间才是你真正的家——一张床铺。"),
  Aside(
    "在查理捡到你的前几年，他和你共享这处休息区；在你能承担工作任务之后，你们两个就轮流使用这块区域了——那很艰难，不过你们积累一笔不错的信用点，如果一切按部就班，再过几年，查理或许会退休，或许会去卫星上养老，或许……",
  ),
  Aside(
    "而现在，你的目光看向那枚蛋，它没被扔进货架，而被你放在了床垫上，你下意识地给它找了一个柔软的地方——你还没意识到，不过这种想法已经偷偷地在你脑子里盘恒一阵子——是不是该像查理收养你一样孵化这枚蛋呢？",
  ),
  // 播放音效：哗啦啦嘭！
  Aside("查理的邻居回来了，一位角马，查理也是。"),
  Aside(
    "准确地说，整个垃圾分类回收中心只有你不是角马，你是%name，垃圾分类回收中心的鬣狗%name。",
  ),
  George("你好！"),
  Aside(
    "你稍有一点紧张，他的休息时间和你不同，这可能是你们第二次或者第三次见面？",
  ),
  Wildebeest("好。"),
  George("从今天起，这个休息区就只有我了。"),
  Wildebeest("嗯。"),
  George("因为查理死了。"),
  Wildebeest("哦？噢，我想起来了，是这么回事。"),
  George("你们之前相处的怎么样？"),
  Aside("（巨大的低沉的机械运作噪声）"),
  Aside("你和邻居的聊天就像被按下暂停键。"),
  Aside(
    "这上面是太空港的装卸仓，时不时就会响起这样的噪声，但这小小的代价也换来了巨大的收益，你们有更大的空间，甚至还有一列升降货架。",
  ),
  Aside(
    "角马的目光打量着你，你尴尬地微笑着，稍稍担心会不会露出了太多的牙齿，那会让你看起来不太友善。",
  ),
  Aside("你好想舔自己的鼻子。"),
  Aside("……"),
  Aside("噪声过去了。"),
  Wildebeest("不，我和查理不熟。"),
  Aside("他转过身，开始换下工作服，无意再与你交谈。你慢慢地坐下去，床铺很软。"),
  Aside("嘭！"), //（播放重物摔落声，不阻止线程）
  Aside(
    "那枚蛋从床铺上滚到地上，细细纹路出现在它的表面，越来越大，就像是裂缝。",
  ),
  Aside("是的，它就是裂缝。蛋摔坏了。"),
  Wildebeest("唔，我离它可很远。"),
  Aside("角马说着，他已经换好了衣服。"),
  Wildebeest("我要去公共区，再见。"),
  Aside("他飞快地离开了。"),
  George("再见。"),
  Aside("角马的脚步声渐远。"),
  Aside("再见个屁。"),
  Aside("再他妈的见。"),
  Aside(
    "你几乎是从床铺上弹起来，狠狠咬在对面的货架上，牙齿和金属发出酸涩的嘎吱声，本能让你疯狂地晃动脖子，甩动头部，切割想象中的猎物。",
  ),
  Aside(
    "你的手攥冰冷的金属滑轨，就像按着濒死的躯体，兴奋感化成一股热流沿着脊椎爬行到脑子里，你压抑不住的、从胸腔深处发出的闷哼在狭小的休息区内撞击回荡，又被新一阵的机器噪声淹没。",
  ),
  // 播放：机器噪声
  Aside("最终你用尽所有的力气在金属边框留下一个浅浅的痕迹。"),
  Aside("你筋疲力尽。"),
  George("抹布，抹布，抹布……"),
  Aside(
    "货架堆满了曾经的“宝贝”，损坏的内窥镜、备用维生导管、卵形钳、十字滑块联轴器……终于，你找到了该死的抹布，准备擦去刚刚甩的到处都是的口水，还有蛋液，那么大的一个蛋，一定淌的满地都是……等等？",
  ),
  Aside("地面上没有蛋液。"),
  Aside("没有蛋液。"),
  Aside(
    "你蹲下身，看着那枚蛋，指尖摩挲这裂缝的边缘，光滑，甚至有微微的弧度。你用力沿着裂缝一掰——",
  ),
  Aside("咔！"), // 播放：盒子打开的声音（不阻止线程）
  Aside(
    "蛋壳顺滑地分成两半，里面空空如也。没有蛋清，没有蛋黄，没有任何活体组织应有的痕迹。内壁光滑如镜，闪着陶瓷的光泽。",
  ),
  Aside(
    "那道裂缝是一个精心设计的开合口，巧妙地做成了蛋壳碎裂的模样，里面严丝合缝的卡榫在刚才的撞击下刚好弹开。",
  ),
  Aside("躺在两半蛋壳中间的，是一张材质奇特的卡片。"),
  Aside(
    "它很薄，却异常坚韧，像是某种合成织物，又带着一点生物材质的柔韧。你小心地把它翻转过来——",
  ),
  // 场景切换：家园号
  Aside("家园号-全程-顶层豪奢套间<br>目的地：地球"),
  Aside(
    "你知道这趟飞船，这座太空港就是为它建设的，据说是史上最庞大，最昂贵，也最声名远播的星际客轮。你曾经和托尼一起幻想过其中的生活，十几种口味的营养膏，随时供应的热水，真空一般的安静，还有高含氧无异味的空气……",
  ),
  Aside(
    "至于地球，那是你做梦难以想象的地方，你只见过港口的公共屏幕上播放它的广告：蓝天，白云，绿色的植物，水多到可以占满整个镜头，到处都是水——乘坐家园号的有钱人就是去那。",
  ),
  Aside(
    "不过你从不觉得，那和你有什么关系。就像想象自己成为恒星。太遥远，太不真实了。这张船票，这张轻飘飘的、从一颗像蛋的盒子里掉出来的船票，却把那个传说砸到了你的面前，带着沉甸甸的、令人眩晕的重量。",
  ),
  Aside(
    "混乱的思绪像受惊的鼠群在你脑中窜动。狂喜的萌芽刚刚探出头，就被更庞大的疑虑和不安死死压住。本能告诉你，必须藏好它。你迅速将两半蛋壳扣回，裂缝严丝合缝地消失，它又变回那颗巨大、无辜、闪着牙白色光泽的蛋。你把它踹得粉碎，看上去就像经历过无数次磕碰一样。碎片零零散散地投到各个垃圾通道，然后你抓起通讯器，手指因为用力和饥饿而微微发抖。",
  ),
  Aside("联系托尼。现在。"),
  Tony("锟斤拷锟竭讹拷膩……"),
  George("托尼！托尼！"),
  Tony("%name？你应该去食堂排队，难道饭也不吃了吗？"),
  George("别担心那个，我要见你，现在。"),
  Tony("到底出什么事了？"),
  George("见面说，我需要一个安全的地方。"),
  Tony(
    "稍等……好，再来一趟告别厅，我用你的名义发起一次投诉访问，接待人是我。这样在解决投诉期间那边的监控器会暂时地故障一会儿，方便我采取一切可能的拒保行动。",
  ),
  Aside("20分钟后，我闻到熟悉的消毒水味。托尼迎了上来。"),
  Tony(
    "我们有大概十五分钟。到底怎么了？流程还有问题，还是有人找你麻烦？垃圾分类中心的那帮蠢货？",
  ),
  Aside("我举起船票，展示在托尼面前。"),
  Tony("我的天，这是？"),
  Aside("托尼不可置信地看着船票，又看向我的脸。"),
  Tony("这是……甚至是不记名的……你从哪弄到的？"),
  Aside(
    "你深吸一口气，从头开始告诉托尼，关于那枚蛋，关于船票……（除了你像野兽的那段）",
  ),
  Tony("那可能是一个礼品盒。"),
  Aside("托尼的指示灯闪烁着。"),
  Tony("其实，有些家伙不吃营养膏……不，去他妈的破事。"),
  Tony(
    "%name，看着我，%name，你知道船票意味着什么吗？离开这里。离开Am-ω-7，离开垃圾分类中心，离开这该死的太空港和那群对着你指指点点家伙。去地球。不是作为广告里的一个远景，而是真正踏上那的地面，呼吸那里的空气，看真正的天空——不是公共显示屏播放的那种！",
  ),
  Choice("branch3", [
    "你说的对，再也不会有这么好的机会了。下一趟飞船在什么时候？",
    "可是，到地球我能做什么呢？我的工作怎么办？",
  ]),
  Tony(
    "去他的工作吧！这都什么时候，你还在想这种事，那可是地球！那才是人应该生活的地方，空气、水、食物都是天然的，到处都是，你大可以等到了地球再考虑这种事！",
    [{ key: "branch3", value: "可是，到地球我能做什么呢？我的工作怎么办？" }],
  ),
  Choice(
    "branch4",
    [
      "你说的对，在到达地球前不需要考虑这种事。下一趟飞船在什么时候？",
      "托尼，你去过下面卫星吗？",
    ],
    [{ key: "branch3", value: "可是，到地球我能做什么呢？我的工作怎么办？" }],
  ),
  Tony("嗯？和这有什么关系？", ifbranch3a4),
  George(
    "我出生在这座太空港，我从来没有接触过地面。营养膏？没那个我几乎不知道应该吃什么。噪声？那简直是我的助眠曲，我从小就听着它。异味？不会比我身上的气味更明显。",
    ifbranch3a4,
  ),
  George(
    "地球太遥远，我没法想象一个没有屋顶，没有墙壁，到处是水的地方。托尼，我习惯了，我不想离开，我害怕离开。",
    ifbranch3a4,
  ),
  Tony(
    "别这样，伙计，我不是在逼你离开。太空港挺好的，你愿意留下来陪我，简直感激不尽。",
    ifbranch3a4,
  ),
  Aside("托尼叹了口气。", ifbranch3a4),
  Tony(
    "好，这东西总能排上用处，我可以考虑帮你卖掉这张船票，但卖掉的钱绝对不够再买回它的。",
    ifbranch3a4,
  ),
  {
    name: `<span style="color: orange">托尼</span>`,
    avatar: "",
    message: "你要卖掉这张船票吗？",
    id: "isSell",
    if: ifbranch3a4,
  },
  Choice("branch5", ["不卖船票", "送给托尼", "卖掉船票"], ifbranch3a4),
  George("还是算了，总要去看一眼地球才甘心。", [
    {
      key: "branch3",
      value: "可是，到地球我能做什么呢？我的工作怎么办？",
      next: "and",
    },
    {
      key: "branch4",
      value: "托尼，你去过下面卫星吗？",
      next: "and",
    },
    {
      key: "branch5",
      value: "不卖船票",
    },
  ]),
  ...(() => {
    const ifbranch: IfInterface[] = [
      {
        key: "branch3",
        value: "可是，到地球我能做什么呢？我的工作怎么办？",
        next: "and",
      },
      {
        key: "branch4",
        value: "托尼，你去过下面卫星吗？",
        next: "and",
      },
      {
        key: "branch5",
        value: "送给托尼",
      },
    ];
    return [
      George(
        "托尼，我打算把它送给你，你在很多方面一直都在照顾我，我想除了这个，我再也没什么能表示感谢了。",
        ifbranch,
      ),
      Tony("送给我？", ifbranch),
      Aside("托尼伸手敲敲自己的脑袋。", ifbranch),
      {
        name: `<span style="color: orange">托尼</span>`,
        avatar: "",
        message: "那地方可到处是水，连屋顶都没有，我可去不了。你再想想。",
        next: "isSell",
        if: ifbranch,
      },
    ];
  })(),
  Tony(
    "谢天谢地，你的脑子终于好用了一次，16个小时后就有飞船出发，4个小时后就开始检票。你在这可以等上1小时，剩下3个小时就在港区转悠，等时间一到你就可以拿着票进贵宾候船厅！",
    ifbranch3o4o5,
  ),
  George("托尼，我会想你的。", ifbranch3o4o5),
  Tony("我暂时没收这种权力，除非你到达地球。", ifbranch3o4o5),
  Aside("我又一次抱住了他。", ifbranch3o4o5),
  // 播放太空港剧情音效
  Aside(
    "一艘银色的太空船缓缓地向着太空港驶来，像羽毛一样轻盈，像水滴一样光滑。整座太空港都忙碌起来，先是引力预警器发出低沉的、持续性的嗡鸣，像一头巨鲸在深海发出的鸣叫。然后无数牵引车像蚂蚁一样沿着互不干扰的轨迹爬行，卸下集装箱，堆满港口。",
    ifbranch3o4o5,
  ),
  Aside(
    "下一步，港区所有的灯光，无论是刺目的作业灯还是微弱的指示灯，都开始同步明灭，仿佛整座太空港都在跟随一个遥远的心跳呼吸。接着，主对接廊桥牢牢咬合在客船的气闸，金属骨架传导来的、深沉至极的“咚！”一声沉闷的巨响，更多的管线——能源的、数据的、维生的——如蛇一般自动连接。",
    ifbranch3o4o5,
  ),
  Aside(
    "气闸内侧的指示灯由红转绿，发出柔和的光芒。这一刻，两个世界贯通了。",
    ifbranch3o4o5,
  ),
  Aside(
    "你低头看着手中的船票，那简单的几行字仿佛在发光，在燃烧。地球。一个陌生的，却似乎能容纳所有疲惫灵魂的词语。托尼的话语在你脑中回荡，混合着巨大的低沉的机器轰鸣声，混合着告别厅里消毒水的味道，混合着休息区金属货架的冰冷触感。。",
    ifbranch3o4o5,
  ),
  Aside("光滑的登船通道像是一面镜子，反射出你的身形。", ifbranch3o4o5),
  Aside("你上了船。", ifbranch3o4o5),
  George(
    "卖掉，这应该是一大笔钱吧？让我想想该怎么花它……我们可以在接待区买下一个隔间。也许我可以换一份工作，在候船厅卖卖纪念品什么的，就是那种花花绿绿的铁皮小徽章。",
    ifbranch3a4a5,
  ),
  Tony(
    "啊对，到时候你穿一件操作间的那种白色大褂，平时裹得严严的，每见到一名有钱人就唰得一下敞开衣服，让他看看你衣服里挂着的小铁片，然后被保安追回家。",
    ifbranch3a4a5,
  ),
  George("“卖掉，现在！”你强忍着笑意，坚定地说。", ifbranch3a4a5),
  Tony("你确定？", ifbranch3a4a5),
  George("确定。", ifbranch3a4a5),
  Aside(
    "托尼最后看一眼船票，轻轻摇了摇头，他似乎还想说什么，但撞上你熟悉的倔强的眼神。他轻轻点头，你想那大概是“真拿你没办法”。",
    ifbranch3a4a5,
  ),
  Aside(
    "托尼的屏：别这样，伙计，我不是在逼你离开。太空港挺好的，你愿意留下来陪我，简直感激不尽。幕暗淡下去，只是一个瞬间，屏幕上重新亮起瀑布流，那是数据的原始海洋，你完全未知的领域。",
    ifbranch3a4a5,
  ),
  Aside("时间一分一秒的过去。", ifbranch3a4a5),
  Normal(
    "",
    `<span style="color: darkred;">犹豫之心</span>`,
    "",
    "乔治？乔治！你在干什么，你就像过去无数次做蠢事一样做你这辈子最蠢的决定吗？你得再想想，动动脑子，深思熟虑，衡量自身利弊。快叫托尼回来，快点，你不能在这种事上犯蠢。",
    ifbranch3a4a5,
  ),
  George("我已经做出决定，滚吧。", ifbranch3a4a5),
  Aside("时间一分一秒的过去。", ifbranch3a4a5),
  Normal(
    "",
    `<span style="color: darkblue;">怀疑之心</span>`,
    "",
    "仅此一次的机会，被你浪费掉了。你犯了世上最愚蠢的错误，最难以宽恕的错误，最不可理喻的错误。你就是一只活在垃圾堆里的蠢狗，一辈子在垃圾堆刨食的废物，一步都不敢迈出的懦夫、胆小鬼！你辜负了查理送你最后的礼物。",
    ifbranch3a4a5,
  ),
  George(
    "你知道吗？你说的很有道理，你说的全都对。但又怎样？我对自己很满意，查理也会满意。",
    ifbranch3a4a5,
  ),
  Aside("时间一分一秒的过去。", ifbranch3a4a5),
  Normal(
    "",
    `<span style="color: rebeccapurple;">恐惧之心</span>`,
    "",
    "啧啧，看看你干了什么好事。看看已经过去了多长时间？托尼在干嘛？他在安排另一具身体，他在转移自己的数据，他在花你的钱。再等一会你面前的屏幕就会熄灭，保安会冲进来把你按在地上“你个小偷！”然后查理留下的休息区被收回，你被流放到宇宙真空中，不穿宇航服的那种。",
    ifbranch3a4a5,
  ),
  Aside("……", ifbranch3a4a5),
  Aside("屏幕重新亮起来。", ifbranch3a4a5),
  Tony("搞定！", ifbranch3a4a5),
  Aside("托尼伸了一个懒腰。", ifbranch3a4a5),
  Tony("用了多长时间？", ifbranch3a4a5),
  George("不到1个小时。", ifbranch3a4a5),
  Tony(
    "竟然这么久……让你担心了，不过值得，那张票真的卖了一大笔钱。走吧，我们直接在贵宾候船厅外面等买家。",
    ifbranch3a4a5,
  ),
  // 播放结局 0 音效
  Aside(
    "你成功卖掉船票，拿到了钱。那长长的一串零是你从没见过数字，你险些觉得那是系统乱码。",
    ifbranch3a4a5,
  ),
  Aside(
    "你和托尼去贵宾餐厅大吃一顿，不过在第一次去的时候因为衣服被拦截下来，但你觉得没什么，那是你第一次吃到营养膏之外的食物，你差点控制不住自己，开始甩头撕咬。",
    ifbranch3a4a5,
  ),
  Aside(
    "托尼狠狠嘲笑，要是你去地球，大概每天都在吃这个。你哈哈一笑，探身过去亲了他一口。",
    ifbranch3a4a5,
  ),
  Aside(
    "你们两个在太空港的顶层买下了好几个房间，明明一张床就可以休息，可你买了好几个房间，一个专门放床，一个独立的的淋浴间，一个专门存放稀奇古怪的小玩意，还有一个什么也不放，你和托尼会静静地坐在那，托尼说，这叫冥想。",
    ifbranch3a4a5,
  ),
  Aside("1802天后，你重新参加查理的葬礼，并在葬礼上致辞。", ifbranch3a4a5),
  Aside(
    "3652天后，你第一次踏足卫星的地面，过高的重力让你很不舒服，回去后一个星期你都躺在床上休息并且发誓再也不去了。",
    ifbranch3a4a5,
  ),
  Aside(
    "5478天后，托尼升级了躯体，还换了个闪闪发亮的无缝一体式脑壳，你对此非常满意，把他的旧脑壳改成台灯放在了冥想室。",
    ifbranch3a4a5,
  ),
  Aside(
    "前所未有的满足感充盈着你的内心，托尼抱住你，向你解释，这种感觉叫做幸福。",
    ifbranch3a4a5,
  ),
]);
